Repository: Sanchous19/Star-sky-Xamarin-Forms
Catalog: Project/Project/Project/Resource.*.resx
Languages: ru

source: Add
ru: Добавить

source: Add a star
ru: Добавить звезду

source: Are you sure you want to remove the constellation from the catalog?
ru: Вы действительно хотите удалить созвездие из каталога?

source: Are you sure you want to remove the star from the catalog?
ru: Вы действительно хотите удалить звезду из каталога?

source: Are you sure you want to replace the data?
ru: Вы действительно хотите заменить данные?

source: Back
ru: Назад

source: Cancel
ru: Отмена

source: Catalog of constellations:
ru: Каталог созвездий:

source: Catalog of planets:
ru: Каталог планет:

source: Catalog of stars
ru: Каталог звёзд:

source: Change the data
ru: Изменить данные

source: Confirm action
ru: Подтвердить действие

source: Constellations
ru: Созвездия

source: Correct links
ru: Подкорректировать ссылки

source: Data
ru: Данные

source: Data was successfully added
ru: Данные были успешны добавлены

# Declination
source: Declination, grad.min:
ru: Склонение, град.мин:

# DeclinationMustBeAPositiveNumber
source: Declination should be a number in the range from -90 to 90 (fractional part less than 60)
ru: Склонение должно быть числом в диапазоне от -90 до 90 (дробная часть меньше 60)

source: Delete
ru: Удалить

source: Delete everything
ru: Удалить всё

# EnterTheDeclination
source: enter declination
ru: введите склонение

# EnterTheLuminosity
source: enter luminosity
ru: введите светимость

source: Enter the name
ru: введите название

source: Enter the name of constellation
ru: Дайте название созведию

# EnterTheRadius
source: enter radius
ru: введите радиус

# EnterTheRightAscension
source: enter right ascension
ru: введите прямое восхождение

# EnterTheTemperature
source: enter temperature
ru: введите температуру

source: Enter the URI of image
ru: введите URI картинки

# EnterTheWeight
source: enter weight
ru: введите массу

source: Enter to search
ru: Введите для поиска

source: Error
ru: Ошибка

source: Fields must not be empty
ru: Поля не должны быть пустыми

source: Interactive of planet movement
ru: Интерактив движения планет

source: Internet access
ru: Выход в интернет

source: Language
ru: Язык

source: Luminosity
ru: Светимость

source: Luminosity must be a positive number
ru: Светимость должна быть положительным числом

# LuminosityOfStarLabelText
source: Luminosity, Lo(= 3,827 * 10^26 W):
ru: Светимость, Lo(= 3,827 * 10^26 Вт):

source: Map of starry sky
ru: Карта звёздного неба

source: Name:
ru: Название:

source: No
ru: Нет

source: Notification
ru: Уведомление

source: Observational data
ru: Наблюдательные данные

source: OK
ru: ОK

source: Open
ru: Открыть

# OrbitRadius
source: Orbit radius, *10^6 km
ru: Радиус орбиты, *10^6 км

# PeriodOfRotationAroundTheAxis
source: Period of rotation around the axis, days
ru: Период обращения вокруг своей оси, дней

# PeriodOfRotationAroundTheBody
source: Period of rotation around the body, days
ru: Период ее обращения вокруг этого тела, суток

source: Photos of planets
ru: Снимки планет

source: Physical characteristics
ru: Физические характеристики

source: Planets
ru: Планеты

source: Position on the star map:
ru: Положение на звездной карте:

source: Primary data
ru: Первостепенные данные

source: Radius
ru: Радиус

source: Radius must be a positive number
ru: Радиус должен быть положительным числом

# RadiusOfPlanet
source: Radius, km
ru: Радиус, км

# RadiusOfStarLabelText
source: Radius, Ro(= 6,960 * 10^8 m):
ru: Радиус, Ro(= 6,960 * 10^8 м):

source: Remove constellation from catalog
ru: Удалить созвездие из каталога

source: Remove the star from the catalog
ru: Удалить звезду из каталога

# RightAscension
source: Right ascension, h.min:
ru: Прямое восхождение, ч.мин:

# RightAscensionMustBeAPositiveNumber
source: Right ascension should be a positive number less than 24 (fractional part less than 60)
ru: Прямое восхождение должно быть положительным числом меньше 24 (дробная часть меньше 60)

source: Save
ru: Сохранить

source: Save the link
ru: Сохранить ссылку

source: Select the link
ru: Выбрать ссылку

source: Stars
ru: Звёзды

# StarsAndTwoPoints
source: Stars:
ru: Звёзды:

source: Table of stars
ru: Таблица звёзд

source: Temperature
ru: Температура

source: Temperature must be a positive number
ru: Температура должна быть положительным числом

# TemperatureOfStarLabelText
source: Temperature, К:
ru: Температура, К:

source: The body around which the planet rotates
ru: Тело, вокруг которого планета вращается

source: The constellation has been successfully removed from the catalog
ru: Созвездие было успешно удалено из каталога

source: The data was successfully replaced
ru: Данные были успешны заменены

source: The included stars
ru: Входящие звезды

source: The star has been successfully removed from the catalog
ru: Звезда была успешно удалена из каталога

source: Type:
ru: Тип:

source: Type of star
ru: Тип звезды

source: URI of image:
ru: URI картинки:

source: Weight
ru: Масса

source: Weight must be a positive number
ru: Масса должна быть положительным числом

# WeightOfPlanet
source: Weight, *10^22 kg
ru: Масса, *10^22 кг

# WeightOfStarLabelText
source: Weight, Mo(= (1,98847 ± 0,00007) * 10^30 kg):
ru: Масса, Mo(= (1,98847 ± 0,00007) * 10^30 кг):

source: Yes
ru: Да
